const accordionDataFinal_1 = [
  {
    id: 1,
    title: 'Города федерального значения',
    content: [
      '— это города, которые самостоятельно являются субъектами Российской Федерации, а не частью субъекта.',
      <br key={1} />,
      <br key={2} />,
      'Согласно Конституции Российской Федерации (ст. 65), такой статус имеют три города:',
      <br key={3} />,
      '— Москва,',
      <br key={4} />,
      '— Санкт-Петербург,',
      <br key={5} />,
      '— Севастополь.',
      <br key={6} />,
      <br key={7} />,
      'На данные города приходится 0,03 % территории страны, но 13,15 % её населения и около четверти ВВП.',
      <br key={8} />,
      'Первые два города в разное время выполняли или выполняют функции столиц Российского государства.',
    ],
  },
  {
    id: 2,
    title: 'Право ребенка жить и воспитываться в семье',
    content: [
      '1. Ребенком признается лицо, не достигшее возраста восемнадцати лет (совершеннолетия).',
      <br key={1} />,
      '2. Каждый ребенок имеет право жить и воспитываться в семье, насколько это возможно, право знать своих родителей, право на их заботу, право на совместное с ними проживание, за исключением случаев, когда это противоречит его интересам.',
      <br key={2} />,
      'Ребенок, в том числе усыновленный (удочеренный) или находящийся под опекой или попечительством в семье, включая приемную семью либо в случаях, предусмотренных законами субъектов Российской Федерации, патронатную семью, имеет право преимущественного приема на обучение по основным общеобразовательным программам в государственную или муниципальную образовательную организацию, в которой обучаются его брат и (или) сестра (полнородные и неполнородные, усыновленные (удочеренные), дети, опекунами (попечителями) которых являются родители (законные представители) этого ребенка, или дети, родителями (законными представителями) которых являются опекуны (попечители) этого ребенка, за исключением случаев, предусмотренных частями 5 и 6 статьи 67 Федерального закона от 29 декабря 2012 года N 273-ФЗ "Об образовании в Российской Федерации".',
      <br key={3} />,
      'Ребенок имеет права на воспитание своими родителями, образование, обеспечение его интересов, всестороннее развитие, уважение его человеческого достоинства.',
      <br key={4} />,
      'При отсутствии родителей, при лишении их родительских прав и в других случаях утраты родительского попечения право ребенка на воспитание в семье обеспечивается органом опеки и попечительства в порядке, установленном главой 18 настоящего Кодекса.',
    ],
  },
];

export { accordionDataFinal_1 };
