export const words = [
  {
    title: "Государство",
    text: [
      "Государство — политическая форма организации общества на определённой территории, суверенная организация публичной власти, обладающая аппаратом управления и принуждения, которому подчиняется всё население страны.",
    ],
    img: "",
  },
  {
    title: "Сущность государства",
    text: [
      "Сущность государства – содержательная сторона, то есть, чьи интересы данная организация политической власти осуществляет.",
    ],
    img: "",
  },
];
